using System;

namespace LeagueActivityBot
{
    public static class InsultGenerator
    {
        private static readonly string[] Insults =
        {
            "Еще один гудок с твоей платформы, и твой зубной состав тронется.", "Баба ветрогонка", "Баляба", "Баламошка", "Балахвостъ", "Басалай", "Безпелюха",
                "Безсоромна баба", "Белебеня", "Бзыря", "Бобыня", "Блудоумъ", "Блудяшка", "Визгопряха", "Волочайка", "Вымесокъ", "Выпоротокъ", "Вяжихвостка",
                     "Глазопялка", "Волочайка", "Вымесокъ", "Выпоротокъ", "Вяжихвостка", "Глазопялка", "Глуподырый", "Дуботолкъ", "Дурка", "Елдыга", "Крохобор",
                         "Мешочник", "Несмыселъ", "Обдувало", "Свербигузка", "Скапыжный", "Скоблёное рыло", "Страхолюдъ", "Суемудръ", "Тартыга", "Телеухъ", "Титёшница",
                             "Трупёрда", "Туесъ", "Тюрюхайло", "Урюпа", "Фуфлыга", "Хохрикъ", "Чёртъ", "Шалава", "Шалопутъ", "Шинора", "Шлында", "Шпынь", 
                                "В любом случае виноват Стас", "Если я тебе не нравлюсь ‒ прокачай свое чувство вкуса.","Я завидую людям, которые тебя не знают."
 
            };

        public static string GetInsult() => Insults[new Random().Next(0, Insults.Length)];
    }
}
